{"config": [{"config": {"output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoUZGF0YV9hdWdtZW50YXRpb24ucHnaCDxsYW1iZGE+TgEAAHMA\nAAAA\n", null, null], "trainable": true, "arguments": {}, "output_shape": null, "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_1", "activation": "linear", "kernel_size": [8, 8], "filters": 16, "strides": [4, 4], "kernel_regularizer": null, "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "activation": "linear", "kernel_size": [5, 5], "filters": 32, "strides": [2, 2], "kernel_regularizer": null, "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_3", "activation": "linear", "kernel_size": [5, 5], "filters": 64, "strides": [2, 2], "kernel_regularizer": null, "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "elu", "units": 512, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activation": "linear", "units": 1, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}